#+name: 5-1
#+begin_src C :includes <stdio.h> <ctype.h> :defines BUFSIZE 100
/* Push non-number char after + or - back */
int getch(void);
void ungetch(int);
int getint(int *pn);

char buf[BUFSIZE];
int bufp = 0;

int getch(void) {
  return (bufp > 0) ? buf[--bufp] : getchar();
}

void ungetch(int c) {
  if (bufp >= BUFSIZE) {
    printf("ungetch: too many characters\n");
  } else {
    buf[bufp++] = c;
  }
}

int getint(int *pn) {
  int c, sign;

    while (isspace(c = getch()))
      ;

    if (!isdigit(c) && c != EOF && c != '+' && c != '-') {
      ungetch(c); /* not a number */
      return 0;
    }

    sign = (c == '-') ? -1 : 1;
    if (c == '+' || c == '-') {
      c = getch();
    }
    for (*pn = 0; isdigit(c); c = getch()) {
      ,*pn = 10 * *pn + (c - '0');
    }
    ,*pn *= sign;
    if (c != EOF) {
      ungetch(c);
    }
    return c;
}

int main(void) {
  int arr[10] = {1,2,3,4,5,6,7,8,9,0};
  int n = getint(arr);

  printf("n is %d\n", n);

  return 0;
}

#+end_src

#+RESULTS: 5-1
: n is -1


#+begin_src C :includes <stdio.h>
printf("%d", strlen("this was a bad idea."));
#+end_src

#+RESULTS:
: 20

#+name: 5-3
#+begin_src C :includes <stdio.h> <string.h>
/* Write a pointer-version of =strcat(s, t)=, which copies the string t to the end of string s */
char *cb_strcat(char *s, char *t);

int main() {
  char *s = "This is s, and ";
  char *t = "this is t.";
  printf("printf: %s%s\n", s, t);
  printf("cb_strcat: %s\n", cb_strcat(s, t));
  return 0;
}

char *cb_strcat(char *s, char *t) {
  int s_i;
  int t_i;
  int s_len = strlen(s);
  int t_len = strlen(t);
  int TOTAL = s_len + t_len;
  char* st[TOTAL];
  int *p;

  printf("s_len: %d\n", s_len);
  printf("t_len: %d\n", t_len);

  for (p = s; p < &s[s_len]; p++) {
    /* st[*p] = *p; */
    printf("%c", *p);
  }


  return s;
}

#+end_src

#+RESULTS: 5-3
| printf: |         This | is   | s, | and | this | is | t. |
| s_len:  |           15 |      |    |     |      |    |    |
| t_len:  |           10 |      |    |     |      |    |    |
| T       | sncb_strcat: | This | is | s,  | and  |    |    |
